# CHAPTER 07 - DATA CLEANING AND PREPARATION

## HANDILING MISSING DATA

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## FILTERING OUT MISSING DATA

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna(inplace=True)

In [15]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned = data.dropna()

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df

          0         1         2
0 -1.491671  1.206246 -0.826355
1  0.237280 -0.499392  1.015700
2 -0.091826  0.863460  1.584331
3  1.339722  0.792529 -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [26]:
df.iloc[:4, 1] = NA

In [27]:
df

          0         1         2
0 -1.491671       NaN -0.826355
1  0.237280       NaN  1.015700
2 -0.091826       NaN  1.584331
3  1.339722       NaN -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0 -1.491671       NaN       NaN
1  0.237280       NaN       NaN
2 -0.091826       NaN  1.584331
3  1.339722       NaN -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [30]:
df.dropna()

          0         1         2
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [31]:
df.dropna(thresh=2)

          0         1         2
2 -0.091826       NaN  1.584331
3  1.339722       NaN -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

## FILLINING IN MISSING DATA

In [32]:
df.fillna(0)

          0         1         2
0 -1.491671  0.000000  0.000000
1  0.237280  0.000000  0.000000
2 -0.091826  0.000000  1.584331
3  1.339722  0.000000 -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [33]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.491671  0.500000  0.000000
1  0.237280  0.500000  0.000000
2 -0.091826  0.500000  1.584331
3  1.339722  0.500000 -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [34]:
_ = df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0 -1.491671  0.000000  0.000000
1  0.237280  0.000000  0.000000
2 -0.091826  0.000000  1.584331
3  1.339722  0.000000 -0.485363
4 -0.382336  0.655538  1.240756
5  0.647115 -0.544192  0.735508
6  0.214024  1.296712 -1.232306

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))

In [37]:
df

          0         1         2
0  1.341806  0.687470  0.473447
1 -0.509289 -1.503994  0.795605
2  0.673562  0.434454 -1.378851
3 -0.075067 -0.057880 -0.975632
4  0.552865  0.633090  2.138305
5  0.750711  0.783731 -1.360083

In [38]:
df.iloc[2:, 1] = NA

In [39]:
df

          0         1         2
0  1.341806  0.687470  0.473447
1 -0.509289 -1.503994  0.795605
2  0.673562       NaN -1.378851
3 -0.075067       NaN -0.975632
4  0.552865       NaN  2.138305
5  0.750711       NaN -1.360083

In [40]:
df.iloc[4:, 2] = NA

In [41]:
df

          0         1         2
0  1.341806  0.687470  0.473447
1 -0.509289 -1.503994  0.795605
2  0.673562       NaN -1.378851
3 -0.075067       NaN -0.975632
4  0.552865       NaN       NaN
5  0.750711       NaN       NaN

In [42]:
df.fillna(method='ffill')

          0         1         2
0  1.341806  0.687470  0.473447
1 -0.509289 -1.503994  0.795605
2  0.673562 -1.503994 -1.378851
3 -0.075067 -1.503994 -0.975632
4  0.552865 -1.503994 -0.975632
5  0.750711 -1.503994 -0.975632

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.341806  0.687470  0.473447
1 -0.509289 -1.503994  0.795605
2  0.673562 -1.503994 -1.378851
3 -0.075067 -1.503994 -0.975632
4  0.552865       NaN -0.975632
5  0.750711       NaN -0.975632

In [44]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## DATA TRANSFORMATION

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [47]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [50]:
data['v1'] = range(7)

In [51]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## TRANSFORMING DATA USING A FUNCTION OR MAPPING

In [53]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                    'Pastrami', 'corned beef', 'Bacon',
                    'pastramin', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12,6, 7.5, 8,3, 5, 6]})

In [54]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6    pastramin     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [56]:
lowercased = data['food'].str.lower()

In [57]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6      pastramin
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(meat_to_animal)

In [59]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6    pastramin     3.0     NaN
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [60]:
data['food'] = data['food'].map(lambda x: x.lower())

In [61]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6    pastramin     3.0     NaN
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## REPLACING VALUES

In [62]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [63]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [64]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [65]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [67]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [68]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [69]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## RENAMING AXIS INDEXES

In [70]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [71]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [72]:
transform = lambda x: x[:4].upper()

In [73]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [74]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
data.index = data.index.map(transform)

In [76]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [77]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [79]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [80]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## DISCRETIZATION AND BINNING

In [81]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [82]:
bins = [18, 25, 35, 60, 100]

In [83]:
cats = pd.cut(ages, bins)

In [84]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [85]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [86]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [87]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [88]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [89]:
data = np.random.rand(20)

In [90]:
data

array([0.9159032 , 0.14600699, 0.96025214, 0.63359911, 0.85312222,
       0.89042053, 0.65896878, 0.33602617, 0.60643949, 0.01932309,
       0.30539295, 0.90918756, 0.62617124, 0.45654496, 0.90960666,
       0.85999039, 0.32372633, 0.68514513, 0.17749489, 0.34303595])

In [91]:
pd.cut(data, 4, precision=2)

[(0.73, 0.96], (0.018, 0.25], (0.73, 0.96], (0.49, 0.73], (0.73, 0.96], ..., (0.73, 0.96], (0.25, 0.49], (0.49, 0.73], (0.018, 0.25], (0.25, 0.49]]
Length: 20
Categories (4, interval[float64]): [(0.018, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

In [92]:
data = np.random.randn(1000) # Normally distributed

In [93]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [94]:
cats

[(-3.068, -0.661], (-3.068, -0.661], (-3.068, -0.661], (0.0319, 0.737], (0.0319, 0.737], ..., (0.737, 2.828], (0.0319, 0.737], (0.0319, 0.737], (0.737, 2.828], (0.737, 2.828]]
Length: 1000
Categories (4, interval[float64]): [(-3.068, -0.661] < (-0.661, 0.0319] < (0.0319, 0.737] < (0.737, 2.828]]

In [95]:
pd.value_counts(cats)

(0.737, 2.828]      250
(0.0319, 0.737]     250
(-0.661, 0.0319]    250
(-3.068, -0.661]    250
dtype: int64

In [96]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.266, 0.0319], (-1.266, 0.0319], (-3.068, -1.266], (0.0319, 1.26], (0.0319, 1.26], ..., (1.26, 2.828], (0.0319, 1.26], (0.0319, 1.26], (1.26, 2.828], (1.26, 2.828]]
Length: 1000
Categories (4, interval[float64]): [(-3.068, -1.266] < (-1.266, 0.0319] < (0.0319, 1.26] < (1.26, 2.828]]

## DETECTING AND FILTERING OUTLIERS

In [97]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [98]:
data.head()

          0         1         2         3
0 -1.813961  1.044186  0.689574 -0.585239
1  0.304601 -0.999190  1.130741  0.087766
2 -0.083690  0.577368 -0.095072 -0.414079
3 -0.258568  0.063358  1.595701  1.634289
4 -0.136471  1.094061 -1.227160  0.849732

In [99]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.030242    -0.033923    -0.039051     0.033172
std       1.025536     0.987651     1.016594     1.008723
min      -2.991676    -3.481613    -3.056854    -3.098870
25%      -0.722076    -0.751758    -0.730756    -0.586392
50%      -0.054183    -0.011808    -0.056238     0.041205
75%       0.618669     0.647173     0.646153     0.731301
max       3.638274     3.085310     2.839636     2.607746

In [100]:
col = data[2]

In [101]:
col[np.abs(col) > 3]

656   -3.056854
Name: 2, dtype: float64

In [102]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
100 -0.728597  3.085310  1.941401  0.982046
184  3.638274  1.048246 -1.124940  0.051772
211  3.088553  0.552649 -1.717821 -1.680887
226  3.164909  0.504787 -1.576568  0.604004
479  3.475251  1.377539  0.546069 -0.705268
540  0.777888  0.077713 -0.928758 -3.098870
656 -0.490580  0.431658 -3.056854 -0.953984
696 -0.314300 -3.481613 -0.401035 -1.193683

In [103]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.031609    -0.033527    -0.038994     0.033271
std       1.021157     0.985818     1.016426     1.008420
min      -2.991676    -3.000000    -3.000000    -3.000000
25%      -0.722076    -0.751758    -0.730756    -0.586392
50%      -0.054183    -0.011808    -0.056238     0.041205
75%       0.618669     0.647173     0.646153     0.731301
max       3.000000     3.000000     2.839636     2.607746

In [105]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0 -1.0  1.0

## PERMUTATION AND RANDOM SAMPLING

In [106]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [107]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [108]:
sampler = np.random.permutation(5)

In [109]:
sampler

array([4, 3, 2, 0, 1])

In [110]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [111]:
df.sample(n=3)

   0  1   2   3
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7

In [112]:
choices = pd.Series([7, 7, -1, 6, 4])

In [113]:
choices

0    7
1    7
2   -1
3    6
4    4
dtype: int64

In [114]:
draws = choices.sample(n=10, replace=True)

In [115]:
draws

4    4
3    6
2   -1
4    4
3    6
2   -1
1    7
4    4
3    6
1    7
dtype: int64

## COMPUTING INDICATOR/DUMMY VARIABLES

In [116]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [117]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [118]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [119]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [120]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [121]:
df_with_dummy = df[['data1']].join(dummies)

In [122]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [123]:
mnames = ['movie_id', 'title', 'genres']

In [124]:
movies = pd.read_table('datasets/movielens/movies.dat',
                        sep='::',
                        header=None,
                        names=mnames,
                        engine='python')

In [125]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [126]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [127]:
all_genres = []

In [128]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [129]:
len(all_genres)

6408

In [130]:
genres = pd.unique(all_genres)

In [131]:
len(genres)

18

In [132]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [133]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [134]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [135]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [136]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [137]:
gen = movies.genres[0]

In [138]:
gen

"Animation|Children's|Comedy"

In [139]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [140]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [145]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [146]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

**DEVE TER UM MANEIRA MAIS EFECIENTE E MENOS ARTESANAL PARA GERARA A TABELA DE DUMMIES**

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html

In [147]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [148]:
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [149]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [150]:
np.random.seed(12345)

In [153]:
values = np.random.rand(10)

In [154]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [158]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [159]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## STRING MANIPULATION

In [167]:
val = 'a,b,           guido'

In [168]:
val.split(',')

['a', 'b', '           guido']

In [169]:
pieces = [x.strip() for x in val.split(',')]

In [170]:
pieces

['a', 'b', 'guido']

In [171]:
first, second, third = pieces

In [172]:
first + '::' + second + '::' + third

'a::b::guido'

In [173]:
'guido' in val

True

In [175]:
val.index(',')

1

In [176]:
val.find(':')

-1

In [177]:
val.index(':')

ValueError: substring not found

In [178]:
val.count(',')

2

In [179]:
val.replace(',', '::')

'a::b::           guido'

In [182]:
val.replace(',', '')

'ab           guido'

## REGULAR EXPRESSIONS

In [184]:
import re

In [185]:
text = 'foo          bar\t  baz      \tqux'

In [186]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [189]:
regex = re.compile('\s+')

In [190]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [192]:
regex.findall(text)

['          ', '\t  ', '      \t']

In [193]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [194]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [195]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [196]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [197]:
m = regex.search(text)

In [199]:
m

In [200]:
text[m.start():m.end()]

'dave@google.com'

In [201]:
print(regex.match(text))

None

In [202]:
print(regex.sub('REDACTED' ,text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [203]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [204]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [205]:
m = regex.match('wesm@bright.net')

In [206]:
m

In [207]:
m.groups()

('wesm', 'bright', 'net')

In [208]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [211]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## VECTORIZED STRING FUNCTIONS IN PANDAS

In [213]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [214]:
data = pd.Series(data)

In [215]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [216]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [217]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [218]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [219]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [220]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [221]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [224]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [232]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object